# Вывести на экран все числа в диапазоне от 54 до 9184 кратные 5.

for k in range(54,9185):
    if k % 5 == 0:
        print(k)