# Создать кортеж с цифрами от 0 до 9 и посчитать сумму

cr = (0,1,2,3,4,5,6,7,8,9)
g = sum(cr)
print(g)