# В саду и на лугу сорвали цветы.
# Создайте множество цветов, произрастающих одновременно в саду и на лугу.

garden = {'ромашка', 'роза', 'одуванчик', 'ромашка', 'гладиолус', 'подсолнух', 'роза'}
meadow = {'клевер', 'одуванчик', 'ромашка', 'клевер', 'мак', 'одуванчик', 'ромашка'}

print(garden.intersection(meadow))