# Создайте словарь person, в котором будут присутствовать ключи name, age, city.
# Выведите значение возраста из словаря

person = {'name':'Alena', 'age':27, 'city':'Rogachev'}

print(person["age"])
